app/controllers/pages_controller.rb

SELECT "companies".* FROM "companies"
SELECT COUNT(*) FROM "departments"
---
  def home
    @companies = Company.all
    @departments = Department.all
    @department_count = Department.count

INSERT INTO "companies" ("company_name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["company_name", "Mable"], ["created_at", "2021-03-23 04:19:28.019936"], ["updated_at", "2021-03-23 04:19:28.019936"]]
---
  def create_company
    FactoryBot.create :company